{
  "backend/main.mo": "Actor canister handling user profiles and per-user progress with role-based access control and storage in in‑memory maps.",
  "feature_evidence.json": "Aggregated feature evidence mapping implemented features to related files, components, and requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind base styles defining a warm OKLCH color palette, theme variables, and dark mode overrides.",
  "frontend/index.html": "HTML entry point loading fonts and bootstrapping the React app via main.tsx.",
  "frontend/src/App.tsx": "Top‑level component managing navigation between pages and showing the profile setup modal when authenticated.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper providing header, auth button, bottom navigation, and page content container.",
  "frontend/src/components/AuthGateNotice.tsx": "Alert explaining unsaved progress for guests with a login button tied to Internet Identity.",
  "frontend/src/components/FlashcardPlayer.tsx": "Interactive flashcard viewer with reveal, shuffle, navigation, and progress recording.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter a name and save their profile via backend mutation.",
  "frontend/src/components/QuizPlayer.tsx": "Runs a generated quiz for a topic, tracks answers and score, updates progress, and shows a summary when complete.",
  "frontend/src/components/QuizSummary.tsx": "Displays quiz results with score, messages, and a button to return to topics.",
  "frontend/src/components/TopicPicker.tsx": "Renders selectable topic cards with icons and names, calling onSelect when chosen.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities and handling login/logout states.",
  "frontend/src/hooks/useProgress.ts": "Manages local and backend-synced progress for topics, updating scores and flashcard views.",
  "frontend/src/hooks/useQueries.ts": "React Query wrappers for fetching and saving user profiles and progress via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, warm color utilities, and base styles for light and dark modes.",
  "frontend/src/lib/learningContent.ts": "Provides flashcard content for alphabet, numbers, colors, and shapes, plus a helper to fetch topic-specific items.",
  "frontend/src/lib/progressTypes.ts": "Defines progress-tracking interfaces and a factory for initializing empty progress.",
  "frontend/src/lib/quizEngine.ts": "Generates quizzes by selecting random flashcards, adding distractors, and formatting topic-specific questions.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/HomePage.tsx": "Home page displaying hero image, welcome message, and navigation cards for learning, quizzes, and progress.",
  "frontend/src/pages/LearnPage.tsx": "Allows users to pick a topic and view flashcards for that topic.",
  "frontend/src/pages/ProgressPage.tsx": "Shows per‑topic learning stats and user-specific progress, with optional auth gating.",
  "frontend/src/pages/QuizPage.tsx": "Allows users to choose a topic and take a quiz using the selected content.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters for routing and state persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, typography, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state metadata, required images, existing features, and pending feature requests for a kids learning app."
}